---
kind: method
id: M:Autodesk.Revit.DB.ExportPatternKey.Dispose
source: html/b3e57e77-7f4d-cddb-07c1-6e26695655c9.htm
---
# Autodesk.Revit.DB.ExportPatternKey.Dispose Method

Releases all resources used by the ExportPatternKey

## Syntax (C#)
```csharp
public void Dispose()
```